app/views/participants/show.html.erb

SELECT `bet_games`.* FROM `bet_games` WHERE `bet_games`.`participant_id` = 1
---
</div>
<%@participant.games.group_by{|x| x.game.date.to_date}.sort.each do |date, games|%>

SELECT `bet_teams`.* FROM `bet_teams` WHERE `bet_teams`.`participant_id` = 1
---
<div class='row'>
<%@participant.teams.knockout.group_by{|x| x.stage_before_type_cast}.sort.each do |stage, teams|%>

SELECT `bet_players`.* FROM `bet_players` WHERE `bet_players`.`participant_id` = 1
---

<%@participant.players.group_by{|x| x.stage_before_type_cast}.sort.each do |stage, players|%>