app/views/games/_form.html.erb

SELECT `teams`.* FROM `teams` ORDER BY `teams`.`name` ASC
---
  <div class="field">
    <%= form.collection_select :home_id , Team.order(:name), :id, :name, include_blank: true%>
    <%= form.collection_select :away_id , Team.order(:name), :id, :name, include_blank: true%>