app/views/games/index.html.erb


              <td align="center"><%= Team.winner.winners.map(&:score).compact.sum %></td>
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`winner` = TRUE LIMIT 1


              <td align="center"><%= Team.redcard.redcards.map(&:score).compact.sum %></td>
---
SELECT `teams`.* FROM `teams` WHERE `teams`.`red` = TRUE LIMIT 1


              <td align="center"><%= Player.topplayer.topplayers.map(&:score).compact.sum %></td>
---
SELECT `players`.* FROM `players` WHERE `players`.`top` = TRUE LIMIT 1