app/controllers/games_controller.rb

  def index
    # @games = Game.includes(:games, :away, :home).group_by{|x| x.stage_before_type_cast}.sort_by{|k,v| k}
    @games = Game.includes(:games, :away, :home).group_by{|x| x.stage_before_type_cast}.sort_by{|k,v| k}
---
SELECT `bet_games`.* FROM `bet_games` WHERE `bet_games`.`game_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36)
SELECT `games`.* FROM `games`

    def set_game
      @game = Game.find(params[:id])
---
SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1