app/controllers/participants_controller.rb

SELECT `bet_players`.* FROM `bet_players` WHERE `bet_players`.`participant_id` = 1
SELECT `bet_teams`.* FROM `bet_teams` WHERE `bet_teams`.`participant_id` = 1
SELECT `participants`.* FROM `participants`
---
  def index
    # @participants = Participant.includes(:games, :teams, :players)
    @participants = Participant.includes({games: {game: [:home, :away] }}, {teams: [:team]}, players: :player)

SELECT `bet_players`.* FROM `bet_players` WHERE `bet_players`.`participant_id` = 1
SELECT `bet_teams`.* FROM `bet_teams` WHERE `bet_teams`.`participant_id` = 1
SELECT `participants`.* FROM `participants` WHERE `participants`.`id` = 1 LIMIT 1
---
    def set_participant
      @participant = Participant.includes({games: {game: [:home, :away] }}, {teams: [:team]}, players: :player).find(params[:id])