app/controllers/players_controller.rb

SELECT `players`.* FROM `players`
---
  def index
    @players = Player.all