app/controllers/scores_controller.rb

	def index
		@participants = Participant.includes(:games, :teams, :players).sort_by{|x| x.score_total}.reverse
---
SELECT `participants`.* FROM `participants`