app/models/game.rb

	def self.stage_scores(stage)
		if stage == "pool"
			Bet::Game.all.map(&:score).compact.sum
---
SELECT `bet_games`.* FROM `bet_games`