app/models/participant.rb

	def self.ranking
		sorted.map{|x| {x.id => x.score_total} }
---
SELECT `participants`.* FROM `participants`