app/models/player.rb

		def calculate_topplayer
			topplayer.each do |player|
---
SELECT `players`.* FROM `players` WHERE `players`.`top` = TRUE LIMIT 1