app/models/team.rb

SELECT `teams`.* FROM `teams` WHERE `teams`.`winner` = TRUE LIMIT 1
---
	def self.winner
		Team.find_by(winner: true)

SELECT `teams`.* FROM `teams` WHERE `teams`.`red` = TRUE LIMIT 1
---
	def self.redcard
		Team.find_by(red: true)